########################
### TAPS
########################

tap "homebrew/bundle"
tap "kurtosis-tech/tap"

########################
### BREWS
########################

brew "ansible"
brew "deno"
brew "fzf"
brew "git"
brew "gh"
brew "gnupg"
brew "just"
brew "n"
brew "mas"
brew "python@3.12"
brew "pipx"
brew "pinentry-mac"
brew "rust"
brew "stow"
brew "zoxide"

brew "kurtosis-tech/tap/kurtosis-cli"

########################
### CASKS
########################

# Fonts
cask "font-jetbrains-mono-nerd-font"

# Applications
cask "1password"
cask "brave-browser"
cask "chatgpt"
cask "cursor"
cask "claude"
cask "discord"
cask "orbstack"
cask "fork"
cask "iterm2"
cask "jetbrains-toolbox"
cask "ledger-live"
cask "notion"
cask "notion-calendar"
cask "sublime-text"
cask "telegram"
cask "trezor-suite"
cask "visual-studio-code@insiders"
cask "yubico-authenticator"
cask "yubico-yubikey-manager"
cask "zoom"

########################
### MAS
########################

mas "NepTunes", id: 1006739057
mas "WireGuard", id: 1451685025
mas "Things 3", id: 904280696
